---
kind: type
id: T:Autodesk.Revit.DB.Visual.SolidGlass
source: html/f21fb90a-9c1d-77eb-69c0-775582db84e7.htm
---
# Autodesk.Revit.DB.Visual.SolidGlass

A static class that provides access to the property names that appear in the SolidGlass visual asset schema.

## Syntax (C#)
```csharp
public static class SolidGlass
```